export const errorsType = {
  required: {required: 'Поле обязательно к заполнению'},
  minLength: (value) => ({
    minLength: {
      value: value,
      message: `Минимальное количество символов: ${value}`,
    },
  }),
  validate: {
    message: 'Некорректно введены данные',
  },
};

export const regExp = {
  email:
    /^(([^<>()[\]\\.,;:\s@\"]+(\.[^<>()[\]\\.,;:\s@\"]+)*)|(\".+\"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  phone: /^(\+)?((\d{2,3}) ?\d|\d)(([ -]?\d)|( ?(\d{2,3}) ?)){5,12}\d$/,
};
